app/controllers/resumes_controller.rb

  def index
    @resumes = Resume.all
---
SELECT * FROM "resumes"

  def create
    @resume = Resume.new(params[:resume])


      if @resume.save
---
INSERT INTO "resumes" ("attachment", "created_at", "updated_at", "name") VALUES('instrument1.jpg', '2021-08-16 04:06:53', '2021-08-16 04:06:53', 'Guitar')

  def destroy
    @resume = Resume.find(params[:id])
    @resume.destroy
---
SELECT * FROM "resumes" WHERE ("resumes"."id" = 2)
DELETE FROM "resumes" WHERE "id" = 2